#!/usr/bin/env node


/**
 *****************************************
 * Created by lifx
 * Created on 2018-07-09 17:31:39
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 定义命令
 *****************************************
 */
async function run() {

    // 预处理命令
    await require('../lib')();

    console.log(process.argv);

    // 执行【yarn】命令
    require('yarn/bin/yarn.js');
}


/**
 *****************************************
 * 执行命令
 *****************************************
 */
run().catch(console.error);
