/**
 *****************************************
 * Created by lifx
 * Created on 2018-07-09 17:40:21
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 获取参数
 *****************************************
 */
const args = process.argv.slice(2);


/**
 *****************************************
 * 预处理命令
 *****************************************
 */
module.exports = () => {
    switch(args.shift()) {
        case 'publish':
            return require('./publish')(args);
        default:
            break;
    }
};
